tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "sdl2"
brew "openssl@3"
brew "webp"
brew "allegro"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "boost"
brew "btop"
brew "catch2"
brew "gcc"
brew "suite-sparse"
brew "pkgconf"
brew "hdf5"
brew "cmake"
brew "python@3.13"
brew "conan"
brew "coreutils"
brew "cpp-httplib"
brew "cpr"
brew "cruft"
brew "curl"
brew "docker", link: false
brew "docker-compose"
brew "doxygen"
brew "fastfetch"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@6"
brew "mesa"
brew "freeglut"
brew "gcc@12"
brew "libavif"
brew "gd"
brew "git"
brew "glew"
brew "glslang"
brew "qt"
brew "gnuplot"
brew "go"
brew "govulncheck"
brew "librsvg"
brew "graphviz"
brew "grpc"
brew "gtk+3"
brew "hiredis"
brew "imagemagick"
brew "jq"
brew "keydb"
brew "kotlin"
brew "libpqxx"
brew "llvm@16"
brew "lowdown"
brew "make"
brew "molten-vk"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "ninja"
brew "nlohmann-json"
brew "node"
brew "openvino"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "pipx"
brew "postgresql@14"
brew "powerlevel10k"
brew "pygobject3"
brew "python-setuptools"
brew "python-tk@3.12"
brew "qemu"
brew "redis"
brew "rust"
brew "spoofdpi"
brew "stow"
brew "thefuck"
brew "typescript"
brew "unzip"
brew "vcpkg"
brew "vulkan-headers", link: false
brew "wget"
brew "zlib"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "eqmac"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "goneovim"
cask "hammerspoon"
cask "iina"
cask "inkscape"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "mactex"
cask "monitorcontrol"
cask "mos"
cask "notion"
cask "obs"
cask "obsidian"
cask "rectangle"
cask "stats"
cask "texstudio"
cask "warp"
vscode "42crunch.vscode-openapi"
vscode "arjun.swagger-viewer"
vscode "be5invis.vscode-custom-css"
vscode "blackboxapp.blackbox"
vscode "blackboxapp.blackboxagent"
vscode "brandonkirbyson.vscode-animations"
vscode "catppuccin.catppuccin-vsc"
vscode "daylerees.rainglow"
vscode "drcika.apc-extension"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "illixion.vscode-vibrancy-continued"
vscode "jmkrivocapich.drawfolderstructure"
vscode "josetr.cmake-language-support-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njzy.stats-bar"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "s-nlf-fh.glassit"
vscode "spikespaz.vscode-smoothtype"
vscode "subframe7536.custom-ui-style"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "xaver.clang-format"
vscode "zongou.vs-seti-jetbrainsmononerdfontmono"
